Управление_по_целям_и_KPI/src/Documents/KPI_ВзаимосвязиЦелей/KPI_ВзаимосвязиЦелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ВзаимосвязиЦелей</name>
  <registerRecords>InformationRegister.KPI_ВзаимосвязьЦелейИПоказателей</registerRecords>
  <registerRecords>InformationRegister.KPI_ВзаимосвязьЦелей</registerRecords>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цели</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеЦели</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗависимаяЦель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеЦелевыеПоказатели</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеФильтраАналитик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючАналитики</name>
      <type>
        <types>CatalogRef.KPI_КлючиАналитики</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеОтбораПоСтруктуреКомпании</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтборПоСтруктуреКомпании</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ВзаимосвязьЦелей/KPI_ВзаимосвязьЦелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ВзаимосвязьЦелей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Цель</name>
    <type>
      <types>CatalogRef.KPI_Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗависимаяЦель</name>
    <type>
      <types>CatalogRef.KPI_Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ВзаимосвязьЦелейИПоказателей/KPI_ВзаимосвязьЦелейИПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ВзаимосвязьЦелейИПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтборПоСтруктуреКомпании</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.KPI_КлючиАналитики</types>
    </type>
  </resources>
  <dimensions>
    <name>Цель</name>
    <type>
      <types>CatalogRef.KPI_Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦелевойПоказатель</name>
    <type>
      <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_ВзаимосвязиЦелей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр KPI_ВзаимосвязьЦелей
	Движения.KPI_ВзаимосвязьЦелей.Записывать = Истина;
	Для Каждого ТекСтрокаЗависимыеЦели Из ЗависимыеЦели Цикл
		Движение               = Движения.KPI_ВзаимосвязьЦелей.Добавить();
		Движение.Период        = Дата;
		Движение.Цель          = ТекСтрокаЗависимыеЦели.Цель;
		Движение.ЗависимаяЦель = ТекСтрокаЗависимыеЦели.ЗависимаяЦель;
		Движение.Периодичность = Периодичность;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр KPI_ВзаимосвязьЦелейИПоказателей
	Движения.KPI_ВзаимосвязьЦелейИПоказателей.Записывать = Истина;
	Для Каждого ТекСтрокаЗависимыеЦелевыеПоказатели Из ЗависимыеЦелевыеПоказатели Цикл
		Движение                          = Движения.KPI_ВзаимосвязьЦелейИПоказателей.Добавить();
		Движение.Период                   = Дата;
		Движение.Цель                     = ТекСтрокаЗависимыеЦелевыеПоказатели.Цель;
		Движение.ЦелевойПоказатель        = ТекСтрокаЗависимыеЦелевыеПоказатели.ЦелевойПоказатель;
		Движение.СтруктураКомпании        = СтруктураКомпании;
		Движение.Периодичность            = Периодичность;
		Движение.Вес                      = ТекСтрокаЗависимыеЦелевыеПоказатели.Вес;
		Движение.КлючАналитики            = ТекСтрокаЗависимыеЦелевыеПоказатели.КлючАналитики;
		Движение.ОтборПоСтруктуреКомпании = ТекСтрокаЗависимыеЦелевыеПоказатели.ОтборПоСтруктуреКомпании;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
